emacs.org
#+TITLE: Emacs Literate Configuration
#+AUTHOR: Marcel Arpogaus
#+STARTUP: show2levels indent
#+auto_tangle: t
#+PROPERTY: header-args :mkdirp yes :comments org

* Configuration
** Table of Contents                                               :TOC_3_gh:
- [[#configuration][Configuration]]
  - [[#references][References]]
  - [[#to-dos][To-dos]]
  - [[#notes][Notes]]
    - [[#add-git-url-to-pkg-headlines][Add git url to pkg headlines]]
  - [[#common-header-for-emacs-libraries][Common Header for Emacs Libraries]]
  - [[#early-emacs-initialization][Early Emacs Initialization]]
    - [[#conventional-library-header][Conventional Library Header]]
    - [[#configure-byte-compile][Configure Byte Compile]]
    - [[#optimize-startup-time][Optimize Startup Time]]
    - [[#configure-straight][Configure Straight]]
    - [[#conventional-library-footer][Conventional Library Footer]]
  - [[#emacs-initialization][Emacs Initialization]]
    - [[#conventional-header][Conventional Header]]
    - [[#package-management][Package Management]]
    - [[#benchmark-startup][Benchmark startup]]
    - [[#personal-information][Personal Information]]
    - [[#paths][Paths]]
    - [[#better-defaults][Better Defaults]]
    - [[#keymaps][Keymaps]]
    - [[#custom-lisp-functions][Custom Lisp Functions]]
  - [[#configure-packages][Configure Packages]]
    - [[#ui][UI]]
    - [[#ux][UX]]
    - [[#org][Org]]
    - [[#tools][Tools]]
    - [[#completion][Completion]]
    - [[#version-control][Version Control]]
    - [[#project-management][Project Management]]
    - [[#programming][Programming]]
    - [[#keybindings][Keybindings]]
  - [[#conventional-library-footer-for-initel][Conventional Library Footer for =init.el=]]

** References
This Emacs literate configuration has been inspired by the following projects:

- [[https://github.com/gilbertw1/emacs-literate-starter/blob/master/emacs.org][emacs-literate-starter/emacs.org at master · gilbertw1/emacs-literate-starter...]]
- [[https://github.com/doomemacs/doomemacs][GitHub - doomemacs/doomemacs: An Emacs framework for the stubborn martian hacker]]
- [[https://github.com/rougier/dotemacs][GitHub - rougier/dotemacs: Litterate configuration for GNU Emacs]]
- [[https://github.com/SystemCrafters/crafted-emacs][GitHub - SystemCrafters/crafted-emacs: A sensible base Emacs configuration.]]
- [[https://github.com/terlar/emacs-config][GitHub - terlar/emacs-config: Emacs configuration]]
- [[https://github.com/zoliky/dotemacs][GitHub - zoliky/dotemacs: My GNU Emacs configuration.]]
- [[https://protesilaos.com/emacs/dotemacs][GNU Emacs configuration | Protesilaos Stavrou]]
- [[https://panadestein.github.io/emacsd][Pandenstein - Emacs literate configuration]]
- [[https://systemcrafters.net/emacs-from-scratch/the-best-default-settings/][The 6 Emacs Settings Every User Should Consider - System Crafters]]
** To-dos :noexport_1:
*** TODO Add doom snippets?
- [[https://github.com/ptn/doom-snippets][GitHub - ptn/doom-snippets: The Doom Emacs snippets library]]
*** TODO anzu
https://github.com/emacsorphanage/anzu
** Notes
*** Add git url to pkg headlines
#+begin_src bash :results none
  for p in $(grep -P '^\*\*\*\* ([a-z\-])*$' emacs.org | cut -d ' ' -f 2); do
      url=$(git -C ~/.emacs.d/straight/repos/*$p* remote get-url origin)
      if [ $? -eq 0 ]; then
          sed "s|\*\*\*\* $p|**** [[$url][$p]]|" -i emacs.org
      fi;
  done
#+end_src
** Common Header for Emacs Libraries
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Library-Headers.html][Library Headers (GNU Emacs Lisp Reference Manual)]]
#+NAME: header
#+begin_src shell :var file_name="init.el" :results output
  echo ";;; $file_name --- Emacs configuration file  -*- lexical-binding: t; -*-
  ;; Copyright (C) 2023-$(date +%Y) Marcel Arpogaus

  ;; Author: Marcel Arpogaus
  ;; Created: $(date -I)
  ;; Keywords: configuration
  ;; Homepage: https://github.com/MArpogaus/emacs.d/

  ;; This file is not part of GNU Emacs.

  ;;; Commentary:

  ;; This file has been generated from emacs.org file. DO NOT EDIT.

  ;;; Code:"
#+end_src
** Early Emacs Initialization
:PROPERTIES:
:header-args+: :tangle early-init.el
:END:
This file serves as the initial configuration file for Emacs and aims to establish fundamental settings before Emacs generates the initial frame.
It should only consist of code that is independent of any package.
*** Conventional Library Header
#+begin_src emacs-lisp :noweb yes :comments no
  <<header(file_name="early-init.el")>>
#+end_src
*** Configure Byte Compile
#+begin_src emacs-lisp
  ;; If an `.el' file is newer than its corresponding `.elc', load the `.el'.
  (setq load-prefer-newer t)

  ;; Disable certain byte compiler warnings to cut down on the noise.
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
#+end_src
*** Optimize Startup Time
We're going to increase the gc-cons-threshold to a very high number to decrease the load time and add a hook to measure Emacs startup time.

The following optimisatzion have been inspired by:

- https://github.com/nilcons/emacs-use-package-fast#a-trick-less-gc-during-startup
- https://github.com/mnewt/dotemacs/blob/master/early-init.el
- https://github.com/alexluigit/dirvish/blob/main/docs/.emacs.d.example/early-init.el

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
  ;; Let's lower our GC thresholds back down to a sane level.
  (add-hook 'after-init-hook (lambda ()
                               ;; restore after startup
                               (setq gc-cons-threshold (* 2 1000 1000)
                                     gc-cons-percentage 0.1)))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))


  ;; Default frame settings. This is actually maximized, not full screen.
  (push '(fullscreen . maximized) initial-frame-alist)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t
        frame-resize-pixelwise t)

  ;; Ignore X resources; its settings would be redundant with the other settings
  ;; in this file and can conflict with later config (particularly where the
  ;; cursor color is concerned).
  (advice-add #'x-apply-session-resources :override #'ignore)

  ;; Unset `file-name-handler-alist' too (temporarily). Every file opened and
  ;; loaded by Emacs will run through this list to check for a proper handler for
  ;; the file, but during startup, it won’t need any of them.
  (defvar file-name-handler-alist-old file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist file-name-handler-alist-old)))

  ;; further preformance tweaks
  (setq
   auto-mode-case-fold nil ; Use case-sensitive `auto-mode-alist' for performance
   fast-but-imprecise-scrolling t ; More performant rapid scrolling over unfontified regions
   ffap-machine-p-known 'reject ; Don't ping things that look like domain names
   idle-update-delay 1.0  ; slow down UI updates down
   inhibit-compacting-font-caches t ; Inhibit frame resizing for performance
   read-process-output-max (* 1024 1024) ; Increase how much is read from processes in a single chunk.
   redisplay-skip-fontification-on-input t ; Inhibits it for better scrolling performance.
   command-line-x-option-alist nil ; Remove irreleant command line options for faster startup
   select-active-regions 'only ; Emacs hangs when large selections contain mixed line endings.
   vc-follow-symlinks t) ; Do not ask about symlink following

  ;; Minimal UI
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src
*** Configure Straight
This section provides the bootstrap code for =straight.el=, a package manager for Emacs.
The code includes optimization for startup time, disables file modification checking for performance, and loads the =straight.el= bootstrap file, which contains essential functionality.

#+begin_src emacs-lisp
  ;; prevent package.el loading packages prior to their init-file loading.
  (setq package-quickstart nil
        package-enable-at-startup nil)

  ;; straight.el bootstrap code
  ;;disable checking (for speedup).
  (setq straight-check-for-modifications nil)

  ;; Enable straight use-package integration
  (setq straight-use-package-by-default t
        use-package-always-defer t)

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src
*** Conventional Library Footer
#+begin_src emacs-lisp
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src
** Emacs Initialization
:PROPERTIES:
:header-args+: :tangle init.el
:END:
The main initialization file, =init.el=, is responsible for defining essential configurations and variables used in submodules.
*** Conventional Header
#+begin_src emacs-lisp :noweb yes :comments no
  <<header(file_name="init.el")>>
#+end_src
