init.el

;; This section initializes various keymaps used for different purposes.


;; setup keymaps
(use-package emacs
  :preface
  (defvar my/leader-map (make-sparse-keymap) "key-map for leader key")
  (defvar my/version-control-map (make-sparse-keymap) "key-map for version control commands")
  (defvar my/git-gutter-repeat-map (make-sparse-keymap) "key-map for GitGutter commands")
  (defvar my/completion-map (make-sparse-keymap) "key-map for completion commands")
  (defvar my/buffer-map (make-sparse-keymap) "key-map for buffer commands")
  (defvar my/buffer-scale-map (make-sparse-keymap) "key-map for buffer text scale commands")
  (defvar my/window-map (make-sparse-keymap) "key-map for window commands")
  (defvar my/file-map (make-sparse-keymap) "key-map for file commands")
  (defvar my/workspace-map (make-sparse-keymap) "key-map for workspace commands")
  (defvar my/toggle-map (make-sparse-keymap) "key-map for toggle commands")
  (defvar my/open-map (make-sparse-keymap) "key-map for open commands")
  (defvar my/lsp-map (make-sparse-keymap) "key-map for lsp commands")

  :config
  ;; remove keybind for suspend-frame
  (global-unset-key (kbd "C-z"))

  ;; version control and lsp commands
  (define-key my/leader-map "v" (cons "version-control" my/version-control-map))
  (define-key my/version-control-map "g" (cons "gutter" my/git-gutter-repeat-map))
  (define-key my/leader-map "l" (cons "lsp" my/lsp-map))

  ;; completion commands
  (define-key my/leader-map "." (cons "completion" my/completion-map))

  ;; file, buffer, window and workspace commands
  (define-key my/leader-map "b" (cons "buffer" my/buffer-map))
  (define-key my/buffer-map "z" (cons "scale" my/buffer-scale-map))
  (define-key my/leader-map "w" (cons "window" my/window-map))
  (define-key my/leader-map "f" (cons "file" my/file-map))
  (define-key project-prefix-map "w" (cons "workspace" my/workspace-map))

  ;; toggle commands
  (define-key my/leader-map "t" (cons "toggle" my/toggle-map))

  ;; opening recent files ne buffer frame etc
  (define-key my/leader-map "o" (cons "open" my/open-map))

  ;; add predefined maps to leader map
  (define-key my/leader-map "g" (cons "goto" goto-map))
  (define-key my/leader-map "h" (cons "help" help-map))
  (define-key my/leader-map "p" (cons "project" project-prefix-map))
  (define-key my/leader-map "s" (cons "search" search-map))
  ;;    (define-key my/leader-map "x" (cons "C-x" ctl-x-map))

  :bind
  (:map my/buffer-map
        ("e" . eval-buffer)
        ("k" . kill-this-buffer)
        ("K" . kill-buffer)
        ("c" . clone-buffer)
        ("r" . revert-buffer)
        ("e" . eval-buffer)
        ("s" . save-buffer)
        :map my/file-map
        ("f" . find-file)
        ("F" . find-file-other-window)
        ("d" . find-dired)
        ("c" . copy-file)
        ("f" . find-file)
        ("d" . delete-file)
        ("r" . rename-file)
        ("w" . write-file)
        :map my/open-map
        ("F" . make-frame)
        ("i" . ielm)
        ("e" . eshell)
        ("t" . term)
        ("s" . scratch-buffer)
        :repeat-map my/buffer-scale-map
        ("+" . text-scale-increase)
        ("-" . text-scale-decrease)
        ("=" . text-scale-adjust)
        :repeat-map my/window-map
        ("n" . next-window-any-frame)
        ("p" . previous-window-any-frame)
        ("k" . delete-window)
        ("K" . kill-buffer-and-window)
        ("+" . enlarge-window)
        ("-" . shrink-window)
        ("*" . enlarge-window-horizontally)
        ("’" . shrink-window-horizontally)
        ("r" . split-window-right)
        ("b" . split-window-below)
        ("v" . split-window-vertically)
        ("h" . split-window-horizontally)
        ("m" . delete-other-windows)
        ("m" . delete-other-windows)
        ("M" . delete-other-windows-vertically)
        :exit
        ("=" . balance-windows)))

;; Custom Lisp Functions

;; In this section, I define some custom Lisp functions.

;; This function extracts the username and repository name from a GitHub repository link.


(defun my/extract-username-repo ()
  "Extract the username and repository name from a GitHub repository link at point."
  (interactive)
  (save-excursion
    (org-back-to-heading)
    (let* ((element (org-element-at-point))
           (headline (org-element-property :raw-value element))
           (url (save-match-data
                  (string-match org-bracket-link-regexp headline)
                  (match-string 1 headline))))
      (if (and url (string-match "github.com/\\([[:alnum:]\.\-]+\\)/\\([[:alnum:]\.\-]+\\)\\(\.git\\)" url))
          (list (match-string 1 url) (match-string 2 url))
        (error "No GitHub link found at point.")))))



;; This function retrieves and inserts the short description of a GitHub repository.


(defun my/insert-github-repo-description ()
  "Retrieve and insert the short description of a GitHub repository at point."
  (interactive)
  (let* ((repo-info (my/extract-username-repo))
         (username (car repo-info))
         (repo (cadr repo-info)))
    (message (format "Inserting description for GitHub Repository. User: %s, Repo: %s" username repo))
    (let* ((url (format "https://api.github.com/repos/%s/%s" username repo))
           (response (with-current-buffer (url-retrieve-synchronously url)
                       (prog1 (buffer-substring-no-properties (point-min) (point-max))
                         (kill-buffer)))))
      (string-match "\r?\n\r?\n" response)
      (setq response (substring response (match-end 0)))
      (let* ((json (json-read-from-string response))
             (description (cdr (assoc 'description json))))
        (if description
            (progn
              (setq description (string-trim description))
              (setq description (concat (capitalize (substring description 0 1))
                                        (substring description 1)))
              (unless (string-suffix-p "." description)
                (setq description (concat description ".")))
              (insert description))
          (error "No description, website, or topics provided."))))))

;; Configure Packages
;; We save the following package declaration into separate files in the =modules= directory.
;; To load the we have to add this directory to the =load-path=.

(add-to-list 'load-path "~/.emacs.d/lisp/")

;; UI
;; :PROPERTIES:
;; :header-args+: :tangle lisp/my-ui.el
;; :END:

(require 'my-ui)

;; UX
;; :PROPERTIES:
