lisp/my-ui.el

;; [[https://github.com/emacs-straight/ascii-art-to-unicode.git][ascii-art-to-unicode]]
;; Make org-brain-visualize-mode look a bit nicer.

(use-package ascii-art-to-unicode
  :after org-brain
  :preface
  (defface aa2u-face '((t . nil))
    "Face for aa2u box drawing characters")
  (defun aa2u-org-brain-buffer ()
    (let ((inhibit-read-only t))
      (make-local-variable 'face-remapping-alist)
      (add-to-list 'face-remapping-alist
                   '(aa2u-face . org-brain-wires))
      (ignore-errors (aa2u (point-min) (point-max)))))
  :config
  (advice-add #'aa2u-1c :filter-return
              (lambda (str) (propertize str 'face 'aa2u-face)))
  :hook
  (org-brain-after-visualize . aa2u-org-brain-buffer))

;; [[https://github.com/LionyxML/auto-dark-emacs.git][auto-dark]]
;; Auto-Dark-Emacs is an auto changer between 2 themes, dark/light, following MacOS, Linux or Windows Dark Mode settings.

(use-package auto-dark
  :custom
  (auto-dark-dark-theme 'modus-vivendi)
  (auto-dark-light-theme 'modus-operandi)
  :hook (after-init . auto-dark-mode))

;; [[https://github.com/emacs-dashboard/emacs-dashboard.git][dashboard]]
