emacs.org
**** [[https://github.com/emacs-dashboard/emacs-dashboard.git][dashboard]]
An extensible emacs dashboard.
#+begin_src emacs-lisp
  (use-package dashboard
    :custom
    ;; Content is not centered by default. To center, set
    (dashboard-center-content t)

    ;; display an alternative emacs logo
    (dashboard-startup-banner 'logo)

    ;; To disable shortcut "jump" indicators for each section, set
    (dashboard-show-shortcuts nil)
    (dashboard-projects-backend 'project-el)
    (dashboard-items '((bookmarks . 20)
                       (recents  . 10)
                       (projects . 10)))
    (dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
    (dashboard-display-icons-p (display-graphic-p))
    (dashboard-set-heading-icons (display-graphic-p))
    (dashboard-set-file-icons (display-graphic-p))
    (dashboard-set-navigator t) ;; show navigator below the banner:
    (dashboard-set-footer nil) ;; disable footer
    :hook
    (after-init . dashboard-setup-startup-hook))
#+end_src
**** display-line-numbers :build_in:
Enable line numbers for some modes
#+begin_src emacs-lisp
  (use-package display-line-numbers
    :hook
    (((prog-mode conf-mode text-mode) . display-line-numbers-mode)
     ;; disable for org mode
     (org-mode . (lambda () (display-line-numbers-mode 0)))))
#+end_src
**** [[https://github.com/seagle0128/doom-modeline.git][doom-modeline]]
A fancy and fast mode-line inspired by minimalism design.
#+begin_src emacs-lisp
  (use-package doom-modeline
    :custom
    ;; If non-nil, cause imenu to see `doom-modeline' declarations.
    ;; This is done by adjusting `lisp-imenu-generic-expression' to
    ;; include support for finding `doom-modeline-def-*' forms.
    ;; Must be set before loading doom-modeline.
    (doom-modeline-support-imenu t)

    ;; How tall the mode-line should be. It's only respected in GUI.
    ;; If the actual char height is larger, it respects the actual height.
    (doom-modeline-height 20)

    ;; display the real names, please put this into your init file.
    (find-file-visit-truename t)

    ;; Whether to use hud instead of default bar. It's only respected in GUI.
    (doom-modeline-hud t)

    ;; Determines the style used by `doom-modeline-buffer-file-name'.
    ;;
    ;; Given ~/Projects/FOSS/emacs/lisp/comint.el
    ;;   auto => emacs/l/comint.el (in a project) or comint.el
    ;;   truncate-upto-project => ~/P/F/emacs/lisp/comint.el
    ;;   truncate-from-project => ~/Projects/FOSS/emacs/l/comint.el
    ;;   truncate-with-project => emacs/l/comint.el
    ;;   truncate-except-project => ~/P/F/emacs/l/comint.el
    ;;   truncate-upto-root => ~/P/F/e/lisp/comint.el
    ;;   truncate-all => ~/P/F/e/l/comint.el
    ;;   truncate-nil => ~/Projects/FOSS/emacs/lisp/comint.el
    ;;   relative-from-project => emacs/lisp/comint.el
    ;;   relative-to-project => lisp/comint.el
    ;;   file-name => comint.el
    ;;   buffer-name => comint.el<2> (uniquify buffer name)
    ;;
    ;; If you are experiencing the laggy issue, especially while editing remote files
    ;; with tramp, please try `file-name' style.
    ;; Please refer to https://github.com/bbatsov/projectile/issues/657.
    (doom-modeline-buffer-file-name-style 'relative-to-project)

    ;; Whether display icons in the mode-line.
    ;; While using the server mode in GUI, should set the value explicitly.
    (doom-modeline-icon (display-graphic-p))

    ;; If non-nil, only display one number for checker information if applicable.
    (doom-modeline-checker-simple-format t)

    :hook
    (after-init . doom-modeline-mode))
#+end_src
**** hl-line :build_in:

Highlighting of the current line (native mode)

#+begin_src emacs-lisp
  (use-package hl-line
    :hook
    ((prog-mode org-mode) . global-hl-line-mode))
#+end_src
**** [[https://github.com/jdtsmith/indent-bars.git][indent-bars]]
Fast, configurable indentation guide-bars for Emacs.
#+begin_src emacs-lisp
  (use-package indent-bars
    :straight (indent-bars :type git :host github :repo "jdtsmith/indent-bars")
    :custom
    (indent-bars-treesit-support t)
    (indent-bars-no-descend-string t)
    (indent-bars-treesit-ignore-blank-lines-types '("module"))
    (indent-bars-treesit-wrap '((python argument_list parameters ; for python, as an example
                                        list list_comprehension
                                        dictionary dictionary_comprehension
                                        parenthesized_expression subscript)))

    (indent-bars-pattern ".")
    (indent-bars-width-frac 0.2)
    (indent-bars-pad-frac 0.1)
    (indent-bars-zigzag nil)
    (indent-bars-color-by-depth nil)
    (indent-bars-highlight-current-depth '(:face default :blend 0.4))
    (indent-bars-display-on-blank-lines nil)
    :hook
    ((python-base-mode yaml-ts-mode emacs-lisp-mode) . indent-bars-mode))
#+end_src
