emacs.org
**** [[https://github.com/mickeynp/ligature.el.git][ligature]]
Display typographical ligatures in Emacs.
#+begin_src emacs-lisp
  (use-package ligature
    :config
    ;; set Fira as default font
    (set-frame-font "FiraCode Nerd Font-10" nil t)
    :preface
    (defun my/setup-ligatures ()
      ;; Enable the "www" ligature in every possible major mode
      (ligature-set-ligatures 't '("www"))
      ;; Enable traditional ligature support in eww-mode, if the
      ;; `variable-pitch' face supports it
      (ligature-set-ligatures '(eww-mode org-mode) '("ff" "fi" "ffi"))
      ;; Enable all Cascadia and Fira Code ligatures in programming modes
      (ligature-set-ligatures '(prog-mode org-mode)
                              '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
                                ;; =:= =!=
                                ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
                                ;; ;; ;;;
                                (";" (rx (+ ";")))
                                ;; && &&&
                                ("&" (rx (+ "&")))
                                ;; !! !!! !. !: !!. != !== !~
                                ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
                                ;; ?? ??? ?:  ?=  ?.
                                ("?" (rx (or ":" "=" "\." (+ "?"))))
                                ;; %% %%%
                                ("%" (rx (+ "%")))
                                ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
                                ;; |->>-||-<<-| |- |== ||=||
                                ;; |==>>==<<==<=>==//==/=!==:===>
                                ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
                                                "-" "=" ))))
                                ;; \\ \\\ \/
                                ("\\" (rx (or "/" (+ "\\"))))
                                ;; ++ +++ ++++ +>
                                ("+" (rx (or ">" (+ "+"))))
                                ;; :: ::: :::: :> :< := :// ::=
                                (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
                                ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
                                ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
                                                "="))))
                                ;; .. ... .... .= .- .? ..= ..<
                                ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
                                ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
                                ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
                                ;; *> */ *)  ** *** ****
                                ("*" (rx (or ">" "/" ")" (+ "*"))))
                                ;; www wwww
                                ("w" (rx (+ "w")))
                                ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
                                ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
                                ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
                                ;; << <<< <<<<
                                ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
                                                "-"  "/" "|" "="))))
                                ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
                                ;; >> >>> >>>>
                                (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
                                ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
                                ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
                                             (+ "#"))))
                                ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
                                ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
                                ;; __ ___ ____ _|_ __|____|_
                                ("_" (rx (+ (or "_" "|"))))
                                ;; Fira code: 0xFF 0x12
                                ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
                                ;; Fira code:
                                "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
                                ;; The few not covered by the regexps.
                                "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
      ;; Enables ligature checks globally in all buffers. You can also do it
      ;; per mode with `ligature-mode'.
      (global-ligature-mode))
    :hook
    (after-init . my/setup-ligatures))
#+end_src
**** [[https://git.sr.ht/~protesilaos/modus-themes][modus-themes]]
Accessible themes for GNU Emacs, conforming with the highest standard for colour contrast between background and foreground values (WCAG AAA)
https://protesilaos.com/emacs/modus-themes

#+begin_src emacs-lisp
  (use-package modus-themes
    :bind
    (:map my/toggle-map
          ("t" . modus-themes-toggle))
    :custom
    ;; Add all your customizations prior to loading the themes
    (modus-themes-italic-constructs t)
    (modus-themes-bold-constructs nil))
#+end_src
**** [[https://github.com/rainstormstudio/nerd-icons.el.git][nerd-icons]]
A Library for Nerd Font icons. Required for modline icons.
#+begin_src emacs-lisp
  (use-package nerd-icons)
#+end_src
**** [[https://github.com/haji-ali/procress.git][procress]]
display LaTeX compilation information in the mode line
#+begin_src emacs-lisp
  (use-package procress
    :straight (:host github :repo "haji-ali/procress")
    :after doom-modeline
    :commands procress-auctex-mode
    :hook
    (LaTeX-mode . procress-auctex-mode)
    :config
    (procress-load-default-svg-images))
#+end_src
**** [[https://github.com/emacs-straight/spacious-padding.git][spacious-padding]]
Increase the padding/spacing of GNU Emacs frames and windows.
#+begin_src emacs-lisp
  (use-package spacious-padding
    :custom
    (spacious-padding-widths '(
                               :internal-border-width 10
                               :header-line-width 1
                               :mode-line-width 4
                               :tab-width 4
                               :right-divider-width 10
                               :scroll-bar-width 4))
    :hook
    (after-init . spacious-padding-mode))
#+end_src
