emacs.org
**** tab-bar :build_in:
#+begin_src emacs-lisp
  (use-package tab-bar
    :straight nil
    :bind
    (:repeat-map my/workspace-map
                 ("p" . tab-previous)
                 ("n" . tab-next)
                 ("P" . tab-bar-move-tab-backward)
                 ("N". tab-bar-move-tab)
                 :exit
                 ("k" . tab-close-group))
    :custom
    (tab-bar-format '(tab-bar-format-history
                      tab-bar-format-tabs-groups
                      my/tab-bar-format-new
                      tab-bar-format-align-right
                      tab-bar-format-global
                      tab-bar-format-menu-bar))
    (tab-bar-separator "")
    (tab-bar-auto-width nil)
    (tab-bar-close-button-show t)
    (tab-bar-new-tab-choice "*dashboard*")
    :preface
    (defun my/tab-bar-format-new ()
      "Button to add a new tab."
      `((add-tab menu-item ,tab-bar-new-button project-switch-project
                 :help "New")))

    (defun my/tab-bar-tab-group-format-function (tab i &optional current-p)
      (let*((tab-group-name (funcall tab-bar-tab-group-function tab))
            (tab-group-face (if current-p 'tab-bar-tab-group-current 'tab-bar-tab-group-inactive))
            (color (face-attribute (if current-p
                                       'mode-line-emphasis
                                     'tab-bar-tab-group-inactive) :foreground))
            (group-sep (propertize " " 'face (list :height (if current-p 0.4 0.2)
                                                   :foreground color
                                                   :background color)))
            (group-icon (cond
                         ((equal tab-group-name "HOME") "")
                         (t ""))))
        (concat
         group-sep
         (propertize
          (concat
           " "
           group-icon
           " "
           (funcall tab-bar-tab-group-function tab)
           " ")
          'face tab-group-face))))

    (defun my/tab-bar-tab-name-format-function (tab i)
      (let ((current-p (eq (car tab) 'current-tab)))
        (propertize
         (concat (if current-p "⏵ " " ")
                 (if tab-bar-tab-hints (format "%d " i) "")
                 (alist-get 'name tab)
                 (if (and tab-bar-close-button-show current-p)
                     tab-bar-close-button " "))
         'face (list :inherit 'tab-bar-tab :weight (if current-p 'bold 'normal)))))

    (defun my/create-home-tab-group (&optional frame)
      (let ((tab-group-name (funcall tab-bar-tab-group-function (tab-bar--current-tab))))
        (when frame (select-frame frame))
        (tab-group (if tab-group-name tab-group-name "HOME"))))

    :config
    (require 'icons)
    (define-icon tab-bar-new nil
      '(
        ;; (emoji "➕")
        (symbol "  " :face tab-bar-tab-inactive)
        (text " + "))
      "Icon for creating a new tab."
      :version "29.1"
      :help-echo "New tab")
    (define-icon tab-bar-close nil
      '(
        ;; (emoji " ❌")
        (symbol " ✕ ") ;; "ⓧ"
        (text " x "))
      "Icon for closing the clicked tab."
      :version "29.1"
      :help-echo "Click to close tab")
    (define-icon tab-bar-menu-bar nil
      '(;; (emoji "🍔")
        (symbol " 󰍜 " :face tab-bar-tab-inactive)
        (text "Menu" :face tab-bar-tab-inactive))
      "Icon for the menu bar."
      :version "29.1"
      :help-echo "Menu bar")

    (setq tab-bar-tab-group-format-function #'my/tab-bar-tab-group-format-function
          tab-bar-tab-name-format-function #'my/tab-bar-tab-name-format-function)

    (add-hook 'after-make-frame-functions 'my/create-home-tab-group)
    (my/create-home-tab-group)
    :hook
    (after-init . tab-bar-mode))
#+end_src
**** tab-line :build_in:
#+begin_src emacs-lisp
  (use-package tab-line
    :straight nil
    :custom
    (tab-line-new-tab-choice . nil)
    (tab-line-new-button-show . nil)
    (tab-line-close-button-show . nil)
    :bind
    (:map my/toggle-map
          ("T" . global-tab-line-mode))
    :preface
    (defun my/tab-line-tab-name-function (buffer &optional _buffers)
      (let ((name (buffer-name buffer)))
        (concat " "
                (nerd-icons-icon-for-file name)
                (format " %s " name))))
    (defun my/switch-to-prev-buffer-skip (window buffer &REST)
      (not (seq-contains-p
            (tab-line-tabs-window-buffers) buffer)))
    :config
    (setq tab-line-tab-name-function #'my/tab-line-tab-name-function
          tab-line-separator "")
    (customize-set-value 'switch-to-prev-buffer-skip #'my/switch-to-prev-buffer-skip)
    :hook
    (after-init . global-tab-line-mode))
#+end_src
**** [[https://codeberg.org/joostkremers/visual-fill-column.git][visual-fill-column]]

#+begin_src emacs-lisp
  (use-package visual-fill-column
    :bind (:map my/toggle-map ("w" . visual-fill-column-mode)))
#+end_src
**** Library Footer
#+begin_src emacs-lisp
  (provide 'my-ui)
  ;;; my-ui.el ends here
#+end_src
*** UX
:PROPERTIES:
:header-args+: :tangle lisp/my-ux.el
:END:
#+begin_src emacs-lisp :tangle init.el
  (require 'my-ux)
#+end_src
**** Conventional Header
#+begin_src emacs-lisp :noweb yes :comments no
  <<header(file_name="my-ux.el")>>
#+end_src
**** autorevert :build_in:
Revert buffers when the underlying file has changed
#+begin_src emacs-lisp
  (use-package autorevert
    :custom
    ;; Revert Dired and other buffers
    (global-auto-revert-non-file-buffers t)
    :hook
    (after-init . global-auto-revert-mode))
#+end_src
**** bookmark :build_in:
#+begin_src emacs-lisp
  (use-package bookmark
    :straight nil
    :custom
    (bookmark-save-flag 1))
#+end_src
**** [[https://github.com/emacs-straight/comint-mime.git][comint-mime]]
Mirror of the comint-mime package from GNU ELPA, current as of 2024-01-18.
Provides a mechanism for REPLs (or comint buffers, in Emacs parlance) to display graphics and other types of special content.
#+begin_src emacs-lisp
  (use-package comint-mime
    :hook
    ((shell-mode . comint-mime-setup)
     (inferior-python-mode . comint-mime-setup)))
#+end_src
**** delsel :build_in:
Replace selected text when typing
#+begin_src emacs-lisp
  (use-package delsel
    :hook
    ((prog-mode conf-mode text-mode) . delete-selection-mode))
#+end_src
**** [[https://github.com/alexluigit/dirvish.git][dirvish]]
A polished Dired with batteries included.
#+begin_src emacs-lisp
  (use-package dirvish
    :custom
    (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
     '(("h" "~/"                          "Home")
       ("d" "~/Downloads/"                "Downloads")
       ("t" "~/.local/share/Trash/files/" "TrashCan")))
    (dirvish-mode-line-format
     '(:left (sort symlink) :right (vc-info yank index)))
    (dirvish-attributes
     '(vc-state file-size git-msg subtree-state nerd-icons collapse file-time))
    (dirvish-use-header-line nil)
    ;; (dirvish-subtree-file-viewer (lambda (&rest _) nil))
    :config
    ;; (dirvish-peek-mode) ; Preview files in minibuffer
    (dirvish-side-follow-mode) ; similar to `treemacs-follow-mode'
    (with-eval-after-load 'doom-modeline
      (setq dirvish-mode-line-height doom-modeline-height)
      (setq dirvish-header-line-height
            doom-modeline-height))
    :bind ; Bind `dirvish|dirvish-side|dirvish-dwim' as you see fit
    (("C-c f" . dirvish-fd)
     :map my/open-map
     ("D" . dirvish)
     :map my/toggle-map
     ("d" . dirvish-side)
     :map dirvish-mode-map ; Dirvish inherits `dired-mode-map'
     ;; ("<mouse-1>" . dirvish-subtree-toggle-or-open)
     ("<mouse-2>" . dired-mouse-find-file-other-window)
     ("F" . dirvish-toggle-fullscreen)
     ("M-b" . dirvish-history-go-backward)
     ("M-e" . dirvish-emerge-menu)
     ("M-f" . dirvish-history-go-forward)
     ("M-j" . dirvish-fd-jump)
     ("M-l" . dirvish-ls-switches-menu)
     ("M-m" . dirvish-mark-menu)
     ("M-s" . dirvish-setup-menu)
     ("M-t" . dirvish-layout-toggle)
     ("N"   . dirvish-narrow)
     ("TAB" . dirvish-subtree-toggle)
     ("^"   . dirvish-history-last)
     ("a"   . dirvish-quick-access)
     ("b"   . dirvish-goto-bookmark)
     ("f"   . dirvish-file-info-menu)
     ("h"   . dirvish-history-jump) ; remapped `describe-mode'
     ("s"   . dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
     ("v"   . dirvish-vc-menu)      ; remapped `dired-view-file'
     ("y"   . dirvish-yank-menu)
     ("z" . dirvish-show-history))
    :hook
    ((after-init . dirvish-override-dired-mode)
     (dirvish-directory-view-mode . diredfl-mode)
     ;; (dired-mode . (lambda nil (setq-local mouse-1-click-follows-link nil)))
     ))
#+end_src
**** elec-pair :build_in:
Automatically add closing parentheses, quotes, etc.
#+begin_src emacs-lisp
  (use-package elec-pair
    :hook
    ((prog-mode conf-mode) . electric-pair-mode))
#+end_src
**** [[https://github.com/roman/golden-ratio.el.git][golden-ratio]]
When working with many windows at the same time, each window has a size that is not convenient for editing.
#+begin_src emacs-lisp
  (use-package golden-ratio
    :custom
    (golden-ratio-exclude-modes '(speedbar-mode vundo-mode dired-mode symbols-outline-mode))
    (golden-ratio-exclude-buffer-regexp '(" ?\\*MINIMAP\\*" " ?\\*Outline\\*"))
    ;; (golden-ratio-auto-scale t)
    :config
    (add-to-list 'golden-ratio-inhibit-functions
                 (lambda ()
                   (and which-key--buffer
                        (window-live-p (get-buffer-window which-key--buffer)))))
    :bind
    (:map my/toggle-map
          ("g" . golden-ratio-mode))
    :hook
    (after-init . golden-ratio-mode))
#+end_src
**** [[https://github.com/dengste/minimap.git][minimap]]
Sidebar showing a "mini-map" of a buffer.
#+begin_src emacs-lisp
  (use-package minimap
    :custom
    (minimap-window-location 'right)
    (minimap-hide-fringes t)
    (minimap-minimum-width 25)
    (minimap-major-modes '(prog-mode conf-mode))
    :config
    (with-eval-after-load 'golden-ratio
      (add-to-list 'golden-ratio-inhibit-functions
                   (lambda ()
                     (and minimap-buffer-name
                          (window-live-p (get-buffer-window minimap-buffer-name)))))
      (add-to-list 'golden-ratio-exclude-buffer-names `(,minimap-buffer-name)))
    :bind
    (:map my/toggle-map
          ("m" . minimap-mode)))
#+end_src
**** paren :build_in:
Paren mode for highlighting matcing paranthesis

#+begin_src emacs-lisp
  (use-package paren
    :custom
    (show-paren-style 'parenthesis)
    (show-paren-when-point-in-periphery t)
    (show-paren-when-point-inside-paren nil)
    :hook
    (prog-mode . show-paren-mode))
#+end_src
**** recentf :build_in:

50 Recents files with some exclusion (regex patterns).

#+begin_src emacs-lisp
  (use-package recentf
    :custom
    (recentf-keep '(file-remote-p file-readable-p))
    (recentf-max-menu-items 10)
    (recentf-max-saved-items 100)
    :config
    (add-to-list 'recentf-exclude
                 (recentf-expand-file-name no-littering-var-directory))
    :bind
    (:map my/open-map
          ("r" . recentf-open))
    :hook
    (after-init . recentf-mode))
#+end_src
**** repeat :build_in:
Enable repeat maps
#+begin_src emacs-lisp
  (use-package repeat
    :hook
    (after-init . repeat-mode))
#+end_src
