lisp/my-ui.el

(use-package tab-bar
  :straight nil
  :bind
  (:repeat-map my/workspace-map
               ("p" . tab-previous)
               ("n" . tab-next)
               ("P" . tab-bar-move-tab-backward)
               ("N". tab-bar-move-tab)
               :exit
               ("k" . tab-close-group))
  :custom
  (tab-bar-format '(tab-bar-format-history
                    tab-bar-format-tabs-groups
                    my/tab-bar-format-new
                    tab-bar-format-align-right
                    tab-bar-format-global
                    tab-bar-format-menu-bar))
  (tab-bar-separator "")
  (tab-bar-auto-width nil)
  (tab-bar-close-button-show t)
  (tab-bar-new-tab-choice "*dashboard*")
  :preface
  (defun my/tab-bar-format-new ()
    "Button to add a new tab."
    `((add-tab menu-item ,tab-bar-new-button project-switch-project
               :help "New")))

  (defun my/tab-bar-tab-group-format-function (tab i &optional current-p)
    (let*((tab-group-name (funcall tab-bar-tab-group-function tab))
          (tab-group-face (if current-p 'tab-bar-tab-group-current 'tab-bar-tab-group-inactive))
          (color (face-attribute (if current-p
                                     'mode-line-emphasis
                                   'tab-bar-tab-group-inactive) :foreground))
          (group-sep (propertize " " 'face (list :height (if current-p 0.4 0.2)
                                                 :foreground color
                                                 :background color)))
          (group-icon (cond
                       ((equal tab-group-name "HOME") "")
                       (t ""))))
      (concat
       group-sep
       (propertize
        (concat
         " "
         group-icon
         " "
         (funcall tab-bar-tab-group-function tab)
         " ")
        'face tab-group-face))))

  (defun my/tab-bar-tab-name-format-function (tab i)
    (let ((current-p (eq (car tab) 'current-tab)))
      (propertize
       (concat (if current-p "⏵ " " ")
               (if tab-bar-tab-hints (format "%d " i) "")
               (alist-get 'name tab)
               (if (and tab-bar-close-button-show current-p)
                   tab-bar-close-button " "))
       'face (list :inherit 'tab-bar-tab :weight (if current-p 'bold 'normal)))))

  (defun my/create-home-tab-group (&optional frame)
    (let ((tab-group-name (funcall tab-bar-tab-group-function (tab-bar--current-tab))))
      (when frame (select-frame frame))
      (tab-group (if tab-group-name tab-group-name "HOME"))))

  :config
  (require 'icons)
  (define-icon tab-bar-new nil
    '(
      ;; (emoji "➕")
      (symbol "  " :face tab-bar-tab-inactive)
      (text " + "))
    "Icon for creating a new tab."
    :version "29.1"
    :help-echo "New tab")
  (define-icon tab-bar-close nil
    '(
      ;; (emoji " ❌")
      (symbol " ✕ ") ;; "ⓧ"
      (text " x "))
    "Icon for closing the clicked tab."
    :version "29.1"
    :help-echo "Click to close tab")
  (define-icon tab-bar-menu-bar nil
    '(;; (emoji "🍔")
      (symbol " 󰍜 " :face tab-bar-tab-inactive)
      (text "Menu" :face tab-bar-tab-inactive))
    "Icon for the menu bar."
    :version "29.1"
    :help-echo "Menu bar")

  (setq tab-bar-tab-group-format-function #'my/tab-bar-tab-group-format-function
        tab-bar-tab-name-format-function #'my/tab-bar-tab-name-format-function)

  (add-hook 'after-make-frame-functions 'my/create-home-tab-group)
  (my/create-home-tab-group)
  :hook
  (after-init . tab-bar-mode))

;; tab-line :build_in:

(use-package tab-line
  :straight nil
  :custom
  (tab-line-new-tab-choice . nil)
  (tab-line-new-button-show . nil)
  (tab-line-close-button-show . nil)
  :bind
  (:map my/toggle-map
        ("T" . global-tab-line-mode))
  :preface
  (defun my/tab-line-tab-name-function (buffer &optional _buffers)
    (let ((name (buffer-name buffer)))
      (concat " "
              (nerd-icons-icon-for-file name)
              (format " %s " name))))
  (defun my/switch-to-prev-buffer-skip (window buffer &REST)
    (not (seq-contains-p
          (tab-line-tabs-window-buffers) buffer)))
  :config
  (setq tab-line-tab-name-function #'my/tab-line-tab-name-function
        tab-line-separator "")
  (customize-set-value 'switch-to-prev-buffer-skip #'my/switch-to-prev-buffer-skip)
  :hook
  (after-init . global-tab-line-mode))

;; [[https://codeberg.org/joostkremers/visual-fill-column.git][visual-fill-column]]


(use-package visual-fill-column
  :bind (:map my/toggle-map ("w" . visual-fill-column-mode)))

;; Library Footer

(provide 'my-ui)
;;; my-ui.el ends here
