emacs.org
**** [[https://github.com/karthink/repeat-help.git][repeat-help]]
#+begin_src emacs-lisp :tangle no
  (use-package repeat-help
    :custom
    (repeat-help-auto nil)
    :hook
    (repeat-mode . repeat-help-mode))
#+end_src
**** [[https://github.com/daichirata/emacs-rotate.git][rotate]]
Rotate the layout of emacs.
#+begin_src emacs-lisp
  (use-package rotate
    :bind
    (:repeat-map my/window-map
                 ("R" . rotate-layout)
                 ("W" . rotate-window)))
#+end_src
**** savehist :build_in:
#+begin_src emacs-lisp
  (use-package savehist
    :custom
    (kill-ring-max 500)
    (history-length 500)
    (savehist-additional-variables
     '(kill-ring
       command-history
       set-variable-value-history
       custom-variable-history
       query-replace-history
       read-expression-history
       minibuffer-history
       read-char-history
       face-name-history
       bookmark-history
       file-name-history))
    ;; No duplicates in history
    (history-delete-duplicates t)
    :config
    (put 'minibuffer-history         'history-length 500)
    (put 'file-name-history          'history-length 500)
    (put 'set-variable-value-history 'history-length 250)
    (put 'custom-variable-history    'history-length 250)
    (put 'query-replace-history      'history-length 250)
    (put 'read-expression-history    'history-length 250)
    (put 'read-char-history          'history-length 250)
    (put 'face-name-history          'history-length 250)
    (put 'bookmark-history           'history-length 250)
    :hook
    ;;Start history mode.
    (after-init . savehist-mode))
#+end_src
**** saveplace :build_in:
Record cursor position from one session to the other
#+begin_src emacs-lisp
  (use-package saveplace
    :hook
    (after-init . save-place-mode))
#+end_src
**** time-stamp :build_in:
Automatically update file timestamps when file is saved
#+begin_src emacs-lisp
  (use-package time-stamp
    :custom
    (time-stamp-active t)
    (time-stamp-format "%04Y-%02m-%02d %02H:%02M:%02S (%U)")
    :hook
    (before-save . time-stamp))
#+end_src
**** winner :build_in:
Undo and redo changes to window configuration
#+begin_src emacs-lisp
  (use-package winner
    :hook
    (after-init . winner-mode))
#+end_src
**** [[https://github.com/joostkremers/writeroom-mode.git][writeroom-mode]]
Distraction-free writing for Emacs.
#+begin_src emacs-lisp
  (use-package writeroom-mode
    :bind (:map my/toggle-map ("z" . writeroom-mode)))
#+end_src
**** Library Footer
#+begin_src emacs-lisp
  (provide 'my-ux)
  ;;; my-ux.el ends here
#+end_src
*** Org
:PROPERTIES:
:header-args+: :tangle lisp/my-org.el
:END:
#+begin_src emacs-lisp :tangle init.el
  (require 'my-org)
#+end_src
**** Conventional Header
#+begin_src emacs-lisp :noweb yes :comments no
  <<header(file_name="my-org.el")>>
#+end_src
