init.el
;; :header-args+: :tangle lisp/my-org.el
;; :END:

(require 'my-org)

;; Tools
;; :PROPERTIES:
