emacs.org
**** [[https://github.com/awth13/org-appear.git][org-appear]]
Toggle visibility of hidden Org mode element parts upon entering and leaving an element.

*test* /aaa/ =babab=
#+begin_src emacs-lisp
  (use-package org-appear
    :after org
    :hook (org-mode . org-appear-mode))
#+end_src
**** [[https://github.com/yilkalargaw/org-auto-tangle.git][org-auto-tangle]]
A simple emacs package to allow org file tangling upon save.
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :after org
    :hook (org-mode . org-auto-tangle-mode))
#+end_src
**** [[https://github.com/Kungsgeten/org-brain.git][org-brain]]
Org-mode wiki + concept-mapping.
#+begin_src emacs-lisp
  (use-package org-brain
    :after org org-noter
    :preface
    ;; from org brain README
    ;; Here’s a command which uses org-cliplink to add a link from the clipboard
    ;; as an org-brain resource.
    ;; It guesses the description from the URL title.
    ;; Here I’ve bound it to L in org-brain-visualize.
    (defun org-brain-cliplink-resource ()
      "Add a URL from the clipboard as an org-brain resource.
    Suggest the URL title as a description for resource."
      (interactive)
      (let ((url (org-cliplink-clipboard-content)))
        (org-brain-add-resource
         url
         (org-cliplink-retrieve-title-synchronously url)
         t)))

    (defun org-brain-open-org-noter (entry)
      "Open `org-noter' on the ENTRY.
    If run interactively, get ENTRY from context."
      (interactive (list (org-brain-entry-at-pt)))
      (org-with-point-at (org-brain-entry-marker entry)
        (org-noter)))

    (defun org-brain-insert-resource-icon (link)
      "Insert an icon, based on content of org-mode LINK."
      (insert (format "%s "
                      (cond ((string-prefix-p "brain:" link)
                             (nerd-icons-flicon "brain"))
                            ((string-prefix-p "info:" link)
                             (nerd-icons-octicon "info"))
                            ((string-prefix-p "help:" link)
                             (nerd-icons-material "help"))
                            ((string-prefix-p "http" link)
                             (nerd-icons-icon-for-url link))
                            (t
                             (nerd-icons-icon-for-file link))))))

    :config
    (add-hook 'org-brain-after-resource-button-functions #'org-brain-insert-resource-icon)
    :custom
    (org-id-track-globally t)
    (org-id-locations-file (expand-file-name "/org-id-locations" user-emacs-directory))
    (org-brain-visualize-default-choices 'all)
    (org-brain-title-max-length 24)
    (org-brain-include-file-entries t)
    (org-brain-file-entries-use-title t)
    :commands
    org-brain-visualize
    :hook
    (before-save . org-brain-ensure-ids-in-buffer))
#+end_src
**** [[https://github.com/rexim/org-cliplink.git][org-cliplink]]
A simple command that takes a URL from the clipboard and inserts an org-mode link with a title of a page found by the URL into the current buffer.

#+begin_src emacs-lisp
  (use-package org-cliplink
    :after org)
#+end_src
**** [[https://github.com/minad/org-modern.git][org-modern]]
This package implements a modern style for your Org buffers using font locking and text properties. The package styles headlines, keywords, tables and source blocks.

#+begin_src emacs-lisp
  (use-package org-modern
    :hook (org-mode . global-org-modern-mode)
    :after (:any org org-agenda)
    :custom
    (org-modern-star '("◉" "○" "◇"))
    (org-modern-label-border 0.3)

    ;; Edit settings
    (org-auto-align-tags t)
    (org-tags-column 0)
    (org-catch-invisible-edits 'show-and-error)
    (org-special-ctrl-a/e t)
    (org-insert-heading-respect-content t)

    ;; Org styling, hide markup etc.
    (org-hide-emphasis-markers t)
    (org-pretty-entities t)

    ;; Agenda styling
    (org-agenda-tags-column 0)
    (org-agenda-block-separator ?─)
    (org-agenda-time-grid
     '((daily today require-timed)
       (800 1000 1200 1400 1600 1800 2000)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
     org-agenda-current-time-string
     "⭠ now ─────────────────────────────────────────────────"))
#+end_src
**** [[https://github.com/jdtsmith/org-modern-indent.git][org-modern-indent]]
Modern block styling with org-indent.
#+begin_src emacs-lisp
  (use-package org-modern-indent
    :straight (org-modern-indent :type git :host github :repo "jdtsmith/org-modern-indent")
    :hook ; add late to hook
    (org-mode . org-modern-indent-mode))
#+end_src
**** [[https://github.com/org-noter/org-noter.git][org-noter]]
Emacs document annotator, using Org-mode.
#+begin_src emacs-lisp
  (use-package org-noter
    :after org
    :custom
    ;; The WM can handle splits
    ;; org-noter-notes-window-location 'other-frame
    ;; Please stop opening frames
    (org-noter-always-create-frame nil)
    ;; I want to see the whole file
    (org-noter-hide-other nil)
    ;; Everything is relative to the main notes file
    ;; org-noter-notes-search-path (list bibtex-completion-notes-path)
    (org-noter-highlight-selected-text t)
    :hook
    ;; Org-noter’s purpose is to let you create notes that are kept in sync when
    ;; you scroll through the [PDF etc] document
    (org-noter-insert-heading . org-id-get-create))
#+end_src
**** [[https://github.com/marcinkoziej/org-pomodoro.git][org-pomodoro]]
Pomodoro technique for org-mode.
#+begin_src emacs-lisp
  (use-package org-pomodoro
    :custom
    (org-pomodoro-audio-player (or (executable-find "paplay")
                                   org-pomodoro-audio-player))
    :config
    (use-package alert
      :config
      (alert-add-rule :category "org-pomodoro"
                      :style (cond (alert-growl-command
                                    'growl)
                                   (alert-notifier-command
                                    'notifier)
                                   (alert-libnotify-command
                                    'libnotify)
                                   (alert-default-style))))
    :bind
    (:map org-mode-map
          ("C-c p" . org-pomodoro)
          :map org-agenda-keymap
          ("p" . org-pomodoro)))
#+end_src
**** [[https://github.com/snosov1/toc-org.git][toc-org]]
Toc-org is an Emacs utility to have an up-to-date table of contents in the org files without exporting (useful primarily for readme files on GitHub).

#+begin_src emacs-lisp
  (use-package toc-org
    :after org
    :hook
    (org-mode . toc-org-enable))
#+end_src
**** [[https://github.com/tarsius/orglink.git][orglink]]
Use Org Mode links in other modes.
#+begin_src emacs-lisp
  (use-package orglink
    :hook
    (prog-mode . orglink-mode))
#+end_src
**** Library Footer
#+begin_src emacs-lisp
  (provide 'my-org)
  ;;; my-org.el ends here
#+end_src
*** Tools
:PROPERTIES:
:header-args+: :tangle lisp/my-tools.el
:END:
#+begin_src emacs-lisp :tangle init.el
  (require 'my-tools)
#+end_src
**** Conventional Header
#+begin_src emacs-lisp :noweb yes :comments no
  <<header(file_name="my-tools.el")>>
#+end_src
**** [[https://github.com/radian-software/ctrlf.git][ctrlf]]
Emacs finally learns how to ctrl+F.
#+begin_src emacs-lisp
  (use-package ctrlf
    :hook
    ((after-init . ctrlf-mode)
     (pdf-isearch-minor-mode . (lambda () (ctrlf-local-mode -1)))))
#+end_src
**** dired :build_in:
#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :custom
    ;; inspired by doom
    ;; https://github.com/doomemacs/doomemacs/blob/c2818bcfaa5dc1a0139d1deff7d77bf42a08eede/modules/emacs/dired/config.el#L9C1-L25C36
    (dired-dwim-target t)  ; suggest a target for moving/copying intelligently
    (dired-hide-details-hide-symlink-targets nil)
    ;; don't prompt to revert, just do it
    (dired-auto-revert-buffer #'dired-buffer-stale-p)
    ;; Always copy/delete recursively
    (dired-recursive-copies  'always)
    (dired-recursive-deletes 'top)
    ;; Ask whether destination dirs should get created when copying/removing files.
    (dired-create-destination-dirs 'ask)
    ;; Screens are larger nowadays, we can afford slightly larger thumbnails
    (image-dired-thumb-size 150)
    (delete-by-moving-to-trash t)
    (dired-listing-switches
     "-l --almost-all --human-readable --group-directories-first --no-group")
    ;; kill all session buffers on quit
    (dirvish-reuse-session nil)
    ;; Enable mouse drag-and-drop support
    (dired-mouse-drag-files t)                   ; added in Emacs 29
    (mouse-drag-and-drop-region-cross-program t) ; added in Emacs 29
    :config
    (use-package dired-x
      :straight nil
      :config
      ;; Make dired-omit-mode hide all "dotfiles"
      (setq dired-omit-files
            (concat dired-omit-files "\\|^\\..*$"))
      :hook
      (dired-mode . dired-omit-mode))
    :bind
    (:map my/open-map
          ("d" . dired)))
#+end_src
**** [[https://github.com/purcell/diredfl.git][diredfl]]
Extra Emacs font lock rules for a more colourful dired.
#+begin_src emacs-lisp
  (use-package diredfl
    :hook (dired-mode . diredfl-mode))
#+end_src
**** ediff :build_in:
The ediff package is utilized to handle file differences in emacs.
We will tweak the Emacs built-in ediff configuration a bit.
[[https://panadestein.github.io/emacsd/#org5917c00][Emacs literate configuration]]

#+begin_src emacs-lisp
  (use-package ediff
    :preface
    (defvar my-ediff-original-windows nil)
    (defun my/store-pre-ediff-winconfig ()
      "This function stores the current window configuration before opening ediff."
      (setq my/ediff-original-windows (current-window-configuration)))
    (defun my/restore-pre-ediff-winconfig ()
      "This function resets the original window arrangement."
      (set-window-configuration my/ediff-original-windows))
    :custom
    (ediff-window-setup-function 'ediff-setup-windows-plain)
    (ediff-split-window-function 'split-window-horizontally)
    :hook
    ((ediff-before-setup . my/store-pre-ediff-winconfig)
     (ediff-quit . my/restore-pre-ediff-winconfig)))
#+end_src
**** [[https://github.com/skeeto/elfeed.git][elfeed]]
An Emacs web feeds client.
#+begin_src emacs-lisp
  (use-package elfeed
    :bind
    (:map my/open-map
          ("f" . elfeed))
    :config
    (setq elfeed-feeds
          (split-string (shell-command-to-string "for d in ~/.emacs.d/straight/repos/*; do git -C $d remote get-url origin; done | grep -P '(github)' | sed 's:\\.git:/releases.atom:'"))))
#+end_src
**** [[https://github.com/purcell/exec-path-from-shell.git][exec-path-from-shell]]
Make Emacs use the $PATH set up by the user's shell.
#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (defun my/copy-ssh-env ()
      (exec-path-from-shell-copy-env "SSH_AGENT_PID")
      (exec-path-from-shell-copy-env "SSH_AUTH_SOCK")
      (exec-path-from-shell-initialize))
    :hook
    (magit-credential . my/copy-ssh-env))
#+end_src
