lisp/my-org.el

(use-package org-appear
  :after org
  :hook (org-mode . org-appear-mode))

(use-package org-auto-tangle
  :after org
  :hook (org-mode . org-auto-tangle-mode))

(use-package org-brain
  :after org org-noter
  :preface
  ;; from org brain README
  ;; Here’s a command which uses org-cliplink to add a link from the clipboard
  ;; as an org-brain resource.
  ;; It guesses the description from the URL title.
  ;; Here I’ve bound it to L in org-brain-visualize.
  (defun org-brain-cliplink-resource ()
    "Add a URL from the clipboard as an org-brain resource.
  Suggest the URL title as a description for resource."
    (interactive)
    (let ((url (org-cliplink-clipboard-content)))
      (org-brain-add-resource
       url
       (org-cliplink-retrieve-title-synchronously url)
       t)))

  (defun org-brain-open-org-noter (entry)
    "Open `org-noter' on the ENTRY.
  If run interactively, get ENTRY from context."
    (interactive (list (org-brain-entry-at-pt)))
    (org-with-point-at (org-brain-entry-marker entry)
      (org-noter)))

  (defun org-brain-insert-resource-icon (link)
    "Insert an icon, based on content of org-mode LINK."
    (insert (format "%s "
                    (cond ((string-prefix-p "brain:" link)
                           (nerd-icons-flicon "brain"))
                          ((string-prefix-p "info:" link)
                           (nerd-icons-octicon "info"))
                          ((string-prefix-p "help:" link)
                           (nerd-icons-material "help"))
                          ((string-prefix-p "http" link)
                           (nerd-icons-icon-for-url link))
                          (t
                           (nerd-icons-icon-for-file link))))))

  :config
  (add-hook 'org-brain-after-resource-button-functions #'org-brain-insert-resource-icon)
  :custom
  (org-id-track-globally t)
  (org-id-locations-file (expand-file-name "/org-id-locations" user-emacs-directory))
  (org-brain-visualize-default-choices 'all)
  (org-brain-title-max-length 24)
  (org-brain-include-file-entries t)
  (org-brain-file-entries-use-title t)
  :commands
  org-brain-visualize
  :hook
  (before-save . org-brain-ensure-ids-in-buffer))

(use-package org-cliplink
  :after org)

(use-package org-modern
  :hook (org-mode . global-org-modern-mode)
  :after (:any org org-agenda)
  :custom
  (org-modern-star '("◉" "○" "◇"))
  (org-modern-label-border 0.3)

  ;; Edit settings
  (org-auto-align-tags t)
  (org-tags-column 0)
  (org-catch-invisible-edits 'show-and-error)
  (org-special-ctrl-a/e t)
  (org-insert-heading-respect-content t)

  ;; Org styling, hide markup etc.
  (org-hide-emphasis-markers t)
  (org-pretty-entities t)

  ;; Agenda styling
  (org-agenda-tags-column 0)
  (org-agenda-block-separator ?─)
  (org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────"))

(use-package org-modern-indent
  :straight (org-modern-indent :type git :host github :repo "jdtsmith/org-modern-indent")
  :hook ; add late to hook
  (org-mode . org-modern-indent-mode))

(use-package org-noter
  :after org
  :custom
  ;; The WM can handle splits
  ;; org-noter-notes-window-location 'other-frame
  ;; Please stop opening frames
  (org-noter-always-create-frame nil)
  ;; I want to see the whole file
  (org-noter-hide-other nil)
  ;; Everything is relative to the main notes file
  ;; org-noter-notes-search-path (list bibtex-completion-notes-path)
  (org-noter-highlight-selected-text t)
  :hook
  ;; Org-noter’s purpose is to let you create notes that are kept in sync when
  ;; you scroll through the [PDF etc] document
  (org-noter-insert-heading . org-id-get-create))

(use-package org-pomodoro
  :custom
  (org-pomodoro-audio-player (or (executable-find "paplay")
                                 org-pomodoro-audio-player))
  :config
  (use-package alert
    :config
    (alert-add-rule :category "org-pomodoro"
                    :style (cond (alert-growl-command
                                  'growl)
                                 (alert-notifier-command
                                  'notifier)
                                 (alert-libnotify-command
                                  'libnotify)
                                 (alert-default-style))))
  :bind
  (:map org-mode-map
        ("C-c p" . org-pomodoro)
        :map org-agenda-keymap
        ("p" . org-pomodoro)))

(use-package toc-org
  :after org
  :hook
  (org-mode . toc-org-enable))

(provide 'my-org)
;;; my-org.el ends here
